Add diagram for testing process, progress #35
